app/Controllers/admin/galeri.php

SELECT *
FROM `tbl_galeri`
---
    public function index()
    {

        $galeri = $this->galeriModels->findAll();