app/Controllers/admin/kesehatan.php

    public function index()
    {

        $kesehatan = $this->kesehatanModels->findAll();
---
SELECT *
FROM `tbl_kesehatan`