app/Controllers/galeri.php

SELECT *
FROM `tbl_galeri`
---
    public function index()
    {

        // memanggil data fasilitasModels() = get data dari fasilitas
        $galeri = $this->galeriModels->findAll();;