app/Controllers/Home.php

SELECT *
FROM `tbl_kesehatan`
ORDER BY `tanggal` DESC
 LIMIT 6
SELECT *
FROM `tbl_kesehatan`
ORDER BY `tanggal` DESC
 LIMIT 2
---
    public function index()
    {
        $kesehatan = $this->kesehatanModels->orderBy("tanggal", "DESC")->limit(6)->find();
        $lalulintas = $this->lalulintasModels->orderBy("tanggal", "DESC")->limit(6)->find();
        $banner2 = $this->kesehatanModels->orderBy("tanggal", "DESC")->limit(2)->find();