app/Controllers/kesehatan.php

SELECT *
FROM `tbl_kesehatan`
SELECT *
FROM `tbl_kesehatan`
ORDER BY `pelihat` DESC
 LIMIT 4
SELECT *
FROM `tbl_kesehatan`
ORDER BY `tanggal` DESC
 LIMIT 3
---
    public function index()
    {

        // memanggil data kesehatanModels() = get data dari kesehatan
        $kesehatan = $this->kesehatanModels->findAll();
        $bpop = $this->kesehatanModels->orderBy("pelihat", "DESC")->limit(4)->find();
        $kbaru = $this->kesehatanModels->orderBy("tanggal", "DESC")->limit(3)->find();

SELECT *
FROM `tbl_kesehatan`
WHERE `tbl_kesehatan`.`id_kes` = '7'
---
    function detail($id_kesehatan)
    {
        $kesehatan = $this->kesehatanModels->find($id_kesehatan);