app/Controllers/login.php

    public function index()
    {
        $user = $this->userModels->findAll();;
---
SELECT *
FROM `tbl_user`