app/Models/KesehatanModels.php

    public function data_kesehatan($id_kes)
    {
        return $this->find($id_kes);
---
SELECT *
FROM `tbl_kesehatan`
WHERE `tbl_kesehatan`.`id_kes` = '7'

    public function update_data($data, $id_kes)
    {
        $query = $this->db->table($this->table)->update(
            $data,
            array('id_kes' => $id_kes)
        );
---
UPDATE `tbl_kesehatan` SET `pelihat` = 6
WHERE `id_kes` = '7'